spec/vcr/spree_avatax_official/create_tax_adjustments/with_incorrect_address.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox-rest.avatax.com/api/v2/transactions/create
    body:
      encoding: UTF-8
      string: '{"type":"SalesOrder","code":"R822664378","referenceCode":"R822664378","companyCode":"test1","date":"2019-09-20","customerCode":"letha@cassin.info","addresses":{"ShipFrom":{"line1":"822
        Reed St","line2":"","city":"Philadelphia","region":"PA","country":"USA","postalCode":"19147"},"ShipTo":{"line1":"Invalid
        street","line2":"","city":"Invalid city","region":"PA","country":"US","postalCode":"00000"}},"lines":[{"number":"LI-a844605f-e114-4933-a0cf-7a434ac83cdf","quantity":1,"amount":"10.0","taxCode":"P0000000","discounted":false,"addresses":{},"taxIncluded":false,"description":"Product
        #55 - 8785","itemCode":"SKU-55"}],"commit":false,"discount":"0.0","currencyCode":"USD","purchaseOrderNo":"R822664378"}'
    headers:
      Accept:
      - application/json; charset=utf-8
      User-Agent:
      - AvaTax Ruby Gem 19.7.0
      X-Avalara-Client:
      - a0o0b000005HsXPAA0;Spree by Spark;RubySdk;19.7.0;
      Authorization:
      - "<AVATAX_TOKEN>"
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Date:
      - Fri, 20 Sep 2019 09:03:50 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Content-Type-Options:
      - nosniff
      Serverduration:
      - '00:00:00.0384727'
    body:
      encoding: UTF-8
      string: '{"error":{"code":"GetTaxError","message":"Tax calculation cannot be
        determined. Zip is not valid for the state.","target":"Unknown","details":[{"code":"GetTaxError","number":300,"message":"Tax
        calculation cannot be determined. Zip is not valid for the state.","description":"Invalid
        St, Invalid city, PA 00000 US (AddressLocationType: ShipTo)","faultCode":"GetTaxError","helpLink":"http://developer.avalara.com/avatax/errors/GetTaxError","refersTo":"Addresses[1]","severity":"Error"}]}}'
    http_version: 
  recorded_at: Fri, 20 Sep 2019 09:03:50 GMT
- request:
    method: post
    uri: https://sandbox-rest.avatax.com/api/v2/transactions/create
    body:
      encoding: UTF-8
      string: '{"type":"SalesOrder","code":"R414996727","referenceCode":"R414996727","companyCode":"test1","date":"2019-09-20","customerCode":"aurea_boyer@langosh.biz","addresses":{"ShipFrom":{"line1":"822
        Reed St","line2":"","city":"Philadelphia","region":"PA","country":"USA","postalCode":"19147"},"ShipTo":{"line1":"Invalid
        street","line2":"","city":"Invalid city","region":"PA","country":"US","postalCode":"00000"}},"lines":[{"number":"LI-a844605f-e114-4933-a0cf-7a434ac83cdf","quantity":1,"amount":"10.0","taxCode":"P0000000","discounted":false,"addresses":{},"taxIncluded":false,"description":"Product
        #1 - 1580","itemCode":"SKU-1"}],"commit":false,"discount":"0.0","currencyCode":"USD","purchaseOrderNo":"R414996727"}'
    headers:
      Accept:
      - application/json; charset=utf-8
      User-Agent:
      - AvaTax Ruby Gem 19.7.0
      X-Avalara-Client:
      - a0o0b000005HsXPAA0;Spree by Spark;RubySdk;19.7.0;
      Authorization:
      - "<AVATAX_TOKEN>"
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Date:
      - Fri, 20 Sep 2019 09:34:07 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Content-Type-Options:
      - nosniff
      Serverduration:
      - '00:00:00.0432240'
    body:
      encoding: UTF-8
      string: '{"error":{"code":"GetTaxError","message":"Tax calculation cannot be
        determined. Zip is not valid for the state.","target":"Unknown","details":[{"code":"GetTaxError","number":300,"message":"Tax
        calculation cannot be determined. Zip is not valid for the state.","description":"Invalid
        St, Invalid city, PA 00000 US (AddressLocationType: ShipTo)","faultCode":"GetTaxError","helpLink":"http://developer.avalara.com/avatax/errors/GetTaxError","refersTo":"Addresses[1]","severity":"Error"}]}}'
    http_version: 
  recorded_at: Fri, 20 Sep 2019 09:34:07 GMT
recorded_with: VCR 4.0.0
